/*************************************************************************
	> File Name: OJ135.c
	> Author: dofo-eat
	> Mail:2354787023@qq.com 
	> Created Time: 2019年11月08日 星期五 18时19分49秒
 ************************************************************************/

#include <stdio.h>
int main() { 
    int n;
    scanf("%d",&n);
    int y,m,d;
    int a[13]={0,31,28,31,30,31,30,31,31,30,31,30,31};
    scanf("%d %d %d",&y,&m,&d);
    if(y%4==0&&y%100||y%400==0)
        a[2]=29;
    if(d==1){
        if(m==1) {
            y1-=1;m1=12;d1=31;
        }else {
            m1-=1;d1=a[m1];
        }
    }
    if(d==a[m]){
        if(m==12) {
            y2+=1;m2=d2=1;
        }else {
            m2+=1;d2=1;
        }
    }
    printf("%d %d %d\n",y1, m1, d1);
    printf("%d %d %d\n",y2, m2, d2);
    return 0;
}
